%Завдання №6
format long
a=7.1e3
b=9.4e4
c=8.3e10
%Квадратне рівняння такого виду ах 2 + bх + с = 0, вирішимо за
%дискримінантом
x1= ((-b)+(sqrt((b^2)-(4*a*c))))/2*a
x2=((-b)-(sqrt((b^2)-(4*a*c))))/2*a
%Робимо перевірку
x3=(a*(x1^2))+(b*x1)+c
x4=(a*(x2^2))+(b*x2)+c
fprintf ('Рівняння %gx^2+%gx+%g=0 \n Корені x1=%g%fi, \nx2=%g %fi',a,b,c,x1,x2,imag(x1),imag(x2))

%Завдання №7
z1=-3-2i
z2=3.21*exp(i*15)
z3=1.2+3i
z4=2.71*exp(78*i)
%Пункт 3
z5=((sqrt(z1*z2))/z3)+z4
%Пункт 4
format long
x=1
exp(i*x)
cos(x)+i*sin(x)





